Функция ПроверкаИмениПеременной(ИмяПеременной)
 
    Если Найти(ИмяПеременной, " ") > 0 ИЛИ Найти(ИмяПеременной, ";") > 0 Тогда
     Сообщить("Ошибка: Имя переменной содержит недопустимые символы");
     Возврат Ложь;
    Иначе
     Если Найти(ИмяПеременной, "[^A-Za-z0-9]") > 0 Тогда
      Сообщить("Ошибка: Имя переменной должно состоять только из букв и цифр");
      Возврат Ложь;
     Иначе
      Возврат Истина;
     КонецЕсли;
    КонецЕсли;
    
КонецФункции

Функция ПрочитатьДанныеНастройки()
    ФайлНастроек = "настройка.ini";

    ФайлПроверкиНастроек = Новый Файл(ФайлНастроек);
    Если Не ФайлПроверкиНастроек.Существует() Тогда
        Сообщить("Файл настроек не найден");
        Возврат Неопределено;
    КонецЕсли;

    ТекстНастроек = Новый ЧтениеТекста;
    ТекстНастроек.Открыть(ФайлНастроек, "UTF-8");
    СтрокаНастроек = ТекстНастроек.ПрочитатьСтроку();
    Если Не ЗначениеЗаполнено(СтрокаНастроек) Тогда
        Сообщить("Ошибка при открытии файла настроек");
        Возврат Неопределено;
    КонецЕсли;
	
    СтруктураВходных = Новый Структура;
    
    Пока СтрокаНастроек <> Неопределено Цикл
        ИндексРавно = Найти(СтрокаНастроек, "=");
        Если ИндексРавно = 0 Тогда
            Сообщить("Ошибка в строке: " + СтрокаНастроек + ". Отсутствует знак = ");
            Возврат Неопределено;
        КонецЕсли;

        ИмяПеременной = СокрЛП(Лев(СтрокаНастроек, ИндексРавно - 1));
        ЗначениеПеременной = СокрЛП(Прав(СтрокаНастроек, СтрДлина(СтрокаНастроек) - ИндексРавно));

        
        Если ПроверкаИмениПеременной(ИмяПеременной) Тогда
            Сообщить("Имена переменных написаны корректно");
           Иначе
            Возврат Неопределено; 
        КонецЕсли;
        
        Если Найти(ЗначениеПеременной, ";") <> 0 Тогда
            ДанныеЗначений = СтрРазделить(ЗначениеПеременной, ";");
        Иначе
            ДанныеЗначений = Новый Массив;
            ДанныеЗначений.Добавить(ЗначениеПеременной);
        КонецЕсли;
        
        СтруктураВходных.Вставить(ИмяПеременной, ДанныеЗначений);

         Если Не ПустаяСтрока(ИмяПеременной) И Не ПустаяСтрока(ЗначениеПеременной) Тогда
            СтруктураВходных.Вставить(ИмяПеременной, ЗначениеПеременной);
         КонецЕсли;
        СтрокаНастроек = ТекстНастроек.ПрочитатьСтроку();

	КонецЦикла;
    

    Если Не СтруктураВходных.Свойство("Путь") ИЛИ Не СтруктураВходных.Свойство("Месяц") ИЛИ Не СтруктураВходных.Свойство("Отчет") Тогда         
        Сообщить("В файле настроек отсутствуют необходимые параметры. Правильный ввод: " +Символы.ПС+ "Путь = C:/ВашПуть/Папка/"+Символы.ПС+ "Месяц = Число" +Символы.ПС+ "Отчет = C:/ВашПуть/НазваниеФайла.txt"+Символы.ПС+ "Завершение работы.");        
        Возврат Неопределено;
    Иначе         
        Сообщить("Все параметры в файле настроек присутствуют");     
    КонецЕсли;

    Возврат СтруктураВходных;
КонецФункции

Функция УдалитьУказанныеФайлы(СтруктураВходных)

    ОтборВремени = СтруктураВходных.Месяц;     
    ПутьКПапкеЧтения = СтруктураВходных.Путь;  

	Сообщить(ПутьКПапкеЧтения);

    ФайлОтчета = СтруктураВходных.Отчет;     
    МесяцевНазад = ДобавитьМесяц(ТекущаяДата(), -ОтборВремени);
    масОписание = Новый Массив;     
    Количество_Удалений = 0;

	Для Каждого Путь Из ПутьКПапкеЧтения Цикл
		СписокФайлов = НайтиФайлы(Путь, "*.*");
		Для Каждого Файл Из СписокФайлов Цикл
			ДатаСоздания = Файл.ПолучитьВремяСоздания();
			Если ДатаСоздания < МесяцевНазад Тогда
				УдалитьФайлы(Файл.ПолноеИмя);
				Количество_Удалений = Количество_Удалений + 1;
				масОписание.Добавить(Файл.Имя + ", " + ДатаСоздания);
			КонецЕсли;
		КонецЦикла; 
	КонецЦикла;
	
	ЗаписьОтчета(масОписание, Количество_Удалений, ФайлОтчета); 
КонецФункции


Функция ЗаписьОтчета(масОписание, Количество_Удалений, Отчет)
	ФайлОтчета = Новый ЗаписьТекста(Отчет, "UTF-8");
	
	ФайлОтчета.ЗаписатьСтроку("Дата и время выполнения: " + ТекущаяДата() + Символы.ПС);
	Если Количество_Удалений = 0 Тогда
		ФайлОтчета.ЗаписатьСтроку("Нет файлов на удаление")
	ИначеЕсли Количество_Удалений > 0 Тогда
		ФайлОтчета.ЗаписатьСтроку("Удалено файлов: " + Количество_Удалений);
		ФайлОтчета.ЗаписатьСтроку("Список удаленных файлов:");
		Для каждого Описание Из масОписание Цикл
			ФайлОтчета.ЗаписатьСтроку(Описание);
		КонецЦикла;
	КонецЕсли;
	
	ФайлОтчета.Закрыть();
КонецФункции

СтруктураВходных = ПрочитатьДанныеНастройки();
Если СтруктураВходных = Неопределено Тогда
	Сообщить("Ошибка  в чтении данных настроек");
КонецЕсли;

//  МассивПутей = Новый Массив;
//  МассивПутей.Добавить("D:/script/test/");
//  МассивПутей.Добавить("D:/script/test1/");
//  СтруктураВходных.Вставить("Путь",МассивПутей);
//  СтруктураВходных.Вставить("Месяц",2);
//  СтруктураВходных.Вставить("Отчет","D:/script/отчет.txt");


 РезультатРаботы = УдалитьУказанныеФайлы(СтруктураВходных);
